# -----------------------------------------------------------------------
# 曜日を表す英語と日本語との対応を表すwdayを定義してください。
# 例： wday[:sunday] #=> "日曜日"
# -----------------------------------------------------------------------
wday = { 
  sunday:     "日曜日", 
  monday:     "月曜日", 
  tuesday:    "火曜日", 
  wedensday:  "水曜日", 
  thursday:   "木曜日", 
  friday:     "金曜日", 
  saturday:   "土曜日" 
}
p wday[:sunday]

# -----------------------------------------------------------------------
# ハッシュのメソッドを使って、wdayのペア数を数えてください。
# -----------------------------------------------------------------------
p wday.length

# -----------------------------------------------------------------------
# eachメソッドとwdayを使って、
# sunday is 日曜日.
# monday is 月曜日.
# と出力してください。
# -----------------------------------------------------------------------
wday.each do |key, value| 
  printf("%10s is %s.\n", key, value)
end

# -----------------------------------------------------------------------
# 空白とタブと改行で区切られた文字列をハッシュに変換するメソッドstr2hash
# を定義してください。
# -----------------------------------------------------------------------
def str2hash(s)
  a = s.split(/\s+/)
  return Hash[*a] rescue {}
end

p str2hash("blue 青 white 白\n\tred 赤")
  #=> {"blue"=>"青", "white"=>"白", "red"=>"赤"}

