# -----------------------------------------------------
# 摂氏温度を華氏温度に変換するメソッドcels_to_fahrを定義してください。
# 華氏 = 摂氏 * 9 / 5 + 32
# -----------------------------------------------------
def cels_to_fahr(cels = 0) = cels * 9 / 5 + 32
celsius = 100
puts "摂氏: #{celsius}, 華氏: #{cels_to_fahr(celsius)}" 

# -----------------------------------------------------
# 上記とは逆のメソッドfahr_to_celsを定義してください。また
# 摂氏1度から摂氏100度までに1度刻みに華氏温度との対応を出力する。
# -----------------------------------------------------
LOW = 1
HIGH = 100
STEP = 1
def fahr_to_cels(fahr = 0) = fahr * 9 /5 - 32
LOW.step(HIGH, STEP) do |cels| 
  printf "華氏: %4d, 摂氏: %4d\n", cels, fahr_to_cels(cels) 
end

# -----------------------------------------------------
# サイコロを振って出た目(1..6までのランダムな整数)を返す
# メソッドdiceを定義してください。
# -----------------------------------------------------
def dice = Random.rand(6) + 1
p dice

# -----------------------------------------------------
# 10個のサイコロを振ってでための合計を返すメソッドdice10を
# 定義してください。
# -----------------------------------------------------
def dice10
  num = 0
  1.upto(10) do |i|
    dice_num = dice
    printf "%2d回目: %d\n", i, dice_num
    num += dice_num
  end
  return num
end
p dice10

# -----------------------------------------------------
# 整数numが素数であるかどうかを調べるメソッドprime?(num)を
# 定義してください。
# -----------------------------------------------------
def prime?(num)
  (2..num-1).each do |i| 
    return true if (num % i) == 0
  end
  return false
end

p prime?(48)

