# -------------------------------------------------------------------------
# "Ruby is an object oriented programming language"という文字列を
# 書く単語を要素とする配列を作成せよ。
# -------------------------------------------------------------------------
s = "Ruby is an object oriented programming language"
p s.split(' ')

# -------------------------------------------------------------------------
# 上記の配列をアルファベット順にソートせよ。
# -------------------------------------------------------------------------
p s.split(' ').sort

# -------------------------------------------------------------------------
# 上記の配列を大文字と小文字の区別せずにアルファベット順にソートせよ。
# -------------------------------------------------------------------------
p s.split(' ').sort_by { |w| w.downcase }

# -------------------------------------------------------------------------
# 一番上の文字列に含まれる文字とその数をヒストグラムせよ。
# -------------------------------------------------------------------------
ascii = Hash.new(0)
s.each_char do |c|
  ascii[c] += 1
end

ascii.keys.sort.each do |c| 
  printf("'%s': %s\n", c, "*" * ascii[c])
end

# -------------------------------------------------------------------------
# "七千百二十三"といった漢数字を7123のような数値に変換するメソッド
# kan2numを定義してください。
# -------------------------------------------------------------------------
kan_num = "一兆三億百万七千百二十三"
def kan2num(text)
  text.tr('零一二三四五六七八九', '0123456789')
    .gsub(/(\d+)?十(\d+)?/) { ($1 || 1).to_i * 10            + $2.to_i }
    .gsub(/(\d+)?百(\d+)?/) { ($1 || 1).to_i * 100           + $2.to_i }
    .gsub(/(\d+)?千(\d+)?/) { ($1 || 1).to_i * 1000          + $2.to_i }
    .gsub(/(\d+)万(\d+)?/)  {        $1.to_i * 10000         + $2.to_i }
    .gsub(/(\d+)億(\d+)?/)  {        $1.to_i * 1000000000    + $2.to_i }
    .gsub(/(\d+)兆(\d+)?/)  {        $1.to_i * 1000000000000 + $2.to_i }
end

puts "before: #{kan_num}, after: #{kan2num(kan_num)}"

